app/views/subs/show.html.erb

<p><%= @sub.description %></p>
<% if @sub.posts.any? %>
---
SELECT  1 AS one FROM "posts" INNER JOIN "postsubs" ON "posts"."id" = "postsubs"."post_id" WHERE "postsubs"."sub_id" = $1 LIMIT 1  [["sub_id", 2]]
SELECT "posts".* FROM "posts" INNER JOIN "postsubs" ON "posts"."id" = "postsubs"."post_id" WHERE "postsubs"."sub_id" = $1  [["sub_id", 2]]