app/views/posts/_form.html.erb

Subs:<br>
<% Sub.all.each do |sub|  %>
  <label><%= check_box_tag :sub_ids, sub.id, post.subs.include?(sub), :name => 'post[sub_ids][]'  %><u><%= sub.title %></u></label><br>
---
SELECT "subs".* FROM "subs"
SELECT "subs".* FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1 AND "subs"."id" = $2  [["post_id", 5], ["id", 2]]