app/views/posts/show.html.erb

<p>Subreddits: </p>
<% @post.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" INNER JOIN "postsubs" ON "subs"."id" = "postsubs"."sub_id" WHERE "postsubs"."post_id" = $1  [["post_id", 5]]

<ul>
  <% @all_comments.select { |comment| comment.parent_comment_id.nil? }.each do |top_comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND "comments"."parent_comment_id" IS NULL  [["post_id", 7]]