app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.commenter_id = params[:commenter_id]
    @comment.post_id = params[:post_id]
    @comment.parent_comment_id = params[:parent_comment_id]

    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "terible title"], ["author_id", 2], ["post_id", 7], ["created_at", "2015-01-09 23:44:03.340734"], ["updated_at", "2015-01-09 23:44:03.340734"]]

  def upvote
    vote = Vote.new(value: 1, voter_id: current_user.id,
    votable_type: 'Comment', votable_id: params[:comment_id])
    if vote.save
---
INSERT INTO "votes" ("value", "voter_id", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", 1], ["voter_id", 1], ["votable_type", "Comment"], ["votable_id", 11], ["created_at", "2015-01-11 10:13:47.845626"], ["updated_at", "2015-01-11 10:13:47.845626"]]

  def downvote
    vote = Vote.new(value: -1, voter_id: current_user.id,
    votable_type: 'Comment', votable_id: params[:comment_id])
    if vote.save
---
INSERT INTO "votes" ("value", "voter_id", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", -1], ["voter_id", 2], ["votable_type", "Comment"], ["votable_id", 12], ["created_at", "2015-01-11 10:17:27.470479"], ["updated_at", "2015-01-11 10:17:27.470479"]]