app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    @post.sub_ids = params[:post][:sub_ids]

    if @post.sub_ids.empty?
      flash[:errors] = "You need to assign a subreddit"
      render :new
    elsif @post.save
---
SELECT "subs".* FROM "subs"
INSERT INTO "posts" ("title", "url", "content", "author_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "dogg"], ["url", ""], ["content", ""], ["author_id", 2], ["sub_id", 2], ["created_at", "2015-01-09 22:06:28.693429"], ["updated_at", "2015-01-09 22:06:28.693429"]]
INSERT INTO "postsubs" ("sub_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sub_id", 2], ["post_id", 6], ["created_at", "2015-01-09 23:14:40.848480"], ["updated_at", "2015-01-09 23:14:40.848480"]]

  def show
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @post = Post.friendly.find(params[:id])
    @post.sub_ids = params[:post][:sub_ids]
    if @post.author_id != current_user.id
      flash[:error] = "You can't edit other people's posts!"
      redirect_to post_url(@post)
    elsif @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "url" = $1, "content" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["url", "http://www.buzzfeed.com/lyapalater/30-of-the-greatest-movie-dogs#.ah2XXe4wdp"], ["content", "30 Of The Greatest Movie Dogs\r\n"], ["updated_at", "2015-01-11 20:19:33.496607"], ["id", 1]]

  def upvote
    vote = Vote.new(value: 1, voter_id: current_user.id,
                  votable_type: 'Post', votable_id: params[:post_id])
    if vote.save
---
INSERT INTO "votes" ("value", "voter_id", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", 1], ["voter_id", 1], ["votable_type", "Post"], ["votable_id", 1], ["created_at", "2015-01-11 09:02:09.422150"], ["updated_at", "2015-01-11 09:02:09.422150"]]

  def downvote
    vote = Vote.new(value: -1, voter_id: current_user.id,
                    votable_type: 'Post', votable_id: params[:post_id])
    if vote.save
---
INSERT INTO "votes" ("value", "voter_id", "votable_type", "votable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["value", -1], ["voter_id", 1], ["votable_type", "Post"], ["votable_id", 2], ["created_at", "2015-01-11 09:04:30.688260"], ["updated_at", "2015-01-11 09:04:30.688260"]]