app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
    @all_comments = @post.comments.includes(:commenter)
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 7]]