app/controllers/subs_controller.rb

  def update
    @sub = Sub.find(params[:id])
    if @sub.moderator_id != current_user.id
      flash[:error] = "You can't edit other people's subreddits!"
      redirect_to sub_url(@sub)
    elsif @sub.update(sub_params)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "Movies"], ["description", "Everything movie"], ["updated_at", "2015-01-11 09:50:52.321988"], ["id", 1]]